name: "ResNet-101"
input: "data"
input_dim: 1
input_dim: 256
input_dim: 56 
input_dim: 56 

layer {
	bottom: "data"
	top: "res2a_branch1"
	name: "bn2a_branch1"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}

layer {
	bottom: "res2a_branch1"
	top: "outbn"
	name: "scale2a_branch1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}

